<<<<<<< HEAD


#Если Сервер или ТолстыйКлиентОбычноеПриложение или ВнешнееСоединение Тогда  
	
#Область ОбработчикиСобытий


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Трудозатраты = Работы.Итог("ТрудозатратыЧ") + Работы.Итог("ТрудозатратыМ")/60;
	
	ЕдинственныйПроект = Неопределено;
	Для каждого стр Из Работы Цикл
		Если ЕдинственныйПроект = Неопределено Тогда
			ЕдинственныйПроект = стр.Проект;		
		ИначеЕсли ЕдинственныйПроект <> стр.Проект Тогда
			ЕдинственныйПроект = Неопределено;
			Прервать;
		КонецЕсли;		
	КонецЦикла;
	Если ЕдинственныйПроект <> Неопределено Тогда
		Проект = ЕдинственныйПроект;
		ЕдинственныйЭтап = Неопределено;
		Для каждого стр Из Работы Цикл
			Если ЕдинственныйЭтап = Неопределено Тогда
				ЕдинственныйЭтап = стр.Этап;		
			ИначеЕсли ЕдинственныйЭтап <> стр.Этап Тогда
				ЕдинственныйЭтап = Неопределено;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		Если ЕдинственныйЭтап <> Неопределено Тогда
			Этап = ЕдинственныйЭтап;
		КонецЕсли;		
	КонецЕсли;
	
	
	ОбновитьПВРСтрок();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	// ПВР создается уникальным для каждого документа.
	Для Каждого стр Из Работы Цикл
		стр.ПВРСтроки = Неопределено;
	КонецЦикла;
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)
	МасПроектов = Новый Массив;
	
	// Формирование движений 
	Движения.bz_Выработка.Записывать = Истина;
	Движения.bz_РаботыКВыставлению.Записывать = Истина;
	Для Каждого ТекСтрокаРаботы Из Работы Цикл
		Движение = Движения.bz_Выработка.Добавить();
		Движение.Период = Дата;
		Движение.ФактическаяДатаВыработки = Дата; 
		Движение.Организация = Организация;
		Движение.Проект = ТекСтрокаРаботы.Проект;
		Движение.Этап = ТекСтрокаРаботы.Этап;
		Движение.Работа = ТекСтрокаРаботы.Работа;
		Движение.Сотрудник = Сотрудник;
		Движение.ТрудозатратыЧД = ТекСтрокаРаботы.ТрудозатратыЧ;
		Движение.ТрудозатратыМД = ТекСтрокаРаботы.ТрудозатратыМ;
		Движение.Трудозатраты = ТекСтрокаРаботы.ТрудозатратыЧ + ТекСтрокаРаботы.ТрудозатратыМ/60;
		Движение.ТрудозатратыМинуты = Окр(ТекСтрокаРаботы.ТрудозатратыМ+ТекСтрокаРаботы.ТрудозатратыЧ*60,0);
		Движение.Содержание = ТекСтрокаРаботы.Содержание;
		Движение.Примечание = ТекСтрокаРаботы.Примечание;
		Движение.ПВР = ТекСтрокаРаботы.ПВРСтроки;


		ДвижениеРВ = Движения.bz_РаботыКВыставлению.Добавить();
		ДвижениеРВ.Период = Дата;
		ЗаполнитьЗначенияСвойств(ДвижениеРВ, Движение);
		
		ДвижениеРВ.КоличествоОтработано = Движение.Трудозатраты;
		
		Если ЗначениеЗаполнено(ТекСтрокаРаботы.Проект) Тогда
			МасПроектов.Добавить(ТекСтрокаРаботы.Проект);
		КонецЕсли;
	КонецЦикла;
	
	МасПроектов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МасПроектов);
	//ПроверитьСоздатьСостояниеЗакрытияПериодаПоПроектам(МасПроектов, Отказ);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	bz_СостоянияЗакрытияПериодов.Состояние КАК Состояние,
	|	bz_СостоянияЗакрытияПериодов.Период КАК Период,
	|	bz_СостоянияЗакрытияПериодов.ДатаДействияПо КАК ДатаДействияПо,
	|	bz_СостоянияЗакрытияПериодов.Проект КАК Проект
	|ИЗ
	|	РегистрСведений.bz_СостоянияЗакрытияПериодов КАК bz_СостоянияЗакрытияПериодов
	|ГДЕ
	|	bz_СостоянияЗакрытияПериодов.Проект В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Т.Проект КАК Проект
	|			ИЗ
	|				Документ.bz_ВыполнениеРабот.Работы КАК Т
	|			ГДЕ
	|				Т.Ссылка = &Ссылка)
	|	И bz_СостоянияЗакрытияПериодов.Период <= &Период
	|	И bz_СостоянияЗакрытияПериодов.ДатаДействияПо >= &Период";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", НачалоДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,"Дата" , , )));
	Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Состояние) и Выборка.Состояние <> Перечисления.bz_СостоянияПроектовВПериодах.Открыт Тогда
			ТекстСообщения = СтрШаблон(
			 	НСтр("ru='Период %1 по проекту %2 %3. Для отмены выработки необходимо его открыть.'"),
			 	ПредставлениеПериода(Выборка.Период, КонецДня(Выборка.ДатаДействияПо)),
				Строка(Выборка.Проект),
				Строка(Выборка.Состояние)
			 );
			 
			 Сообщение = Новый СообщениеПользователю;
			 Сообщение.Текст 		= ТекстСообщения;
			 Сообщение.Поле 			= "Дата";
			 Сообщение.ПутьКДанным 	= "Объект";
			 Сообщение.Сообщить();
			 Отказ = Истина;
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьПВРСтрок()	
	bz_ОбщиеАлгоритмыУУ.СоздатьПВРСтрок(ЭтотОбъект, Документы.bz_ВыполнениеРабот, "Работы", Дата,  "Содержание, Примечание", "ПВРСтроки");
КонецПроцедуры

#КонецОбласти

#КонецЕсли
=======


#Если Сервер или ТолстыйКлиентОбычноеПриложение или ВнешнееСоединение Тогда  
	
#Область ОбработчикиСобытий


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Трудозатраты = Работы.Итог("ТрудозатратыЧ") + Работы.Итог("ТрудозатратыМ")/60;
	
	ЕдинственныйПроект = Неопределено;
	Для каждого стр Из Работы Цикл
		Если ЕдинственныйПроект = Неопределено Тогда
			ЕдинственныйПроект = стр.Проект;		
		ИначеЕсли ЕдинственныйПроект <> стр.Проект Тогда
			ЕдинственныйПроект = Неопределено;
			Прервать;
		КонецЕсли;		
	КонецЦикла;
	Если ЕдинственныйПроект <> Неопределено Тогда
		Проект = ЕдинственныйПроект;
		ЕдинственныйЭтап = Неопределено;
		Для каждого стр Из Работы Цикл
			Если ЕдинственныйЭтап = Неопределено Тогда
				ЕдинственныйЭтап = стр.Этап;		
			ИначеЕсли ЕдинственныйЭтап <> стр.Этап Тогда
				ЕдинственныйЭтап = Неопределено;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		Если ЕдинственныйЭтап <> Неопределено Тогда
			Этап = ЕдинственныйЭтап;
		КонецЕсли;		
	КонецЕсли;
	
	
	ОбновитьПВРСтрок();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	// ПВР создается уникальным для каждого документа.
	Для Каждого стр Из Работы Цикл
		стр.ПВРСтроки = Неопределено;
	КонецЦикла;
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)
	МасПроектов = Новый Массив;
	
	// Формирование движений 
	Движения.bz_Выработка.Записывать = Истина;
	Движения.bz_РаботыКВыставлению.Записывать = Истина;
	Для Каждого ТекСтрокаРаботы Из Работы Цикл
		Движение = Движения.bz_Выработка.Добавить();
		Движение.Период = Дата;
		Движение.ФактическаяДатаВыработки = Дата; 
		Движение.Организация = Организация;
		Движение.Проект = ТекСтрокаРаботы.Проект;
		Движение.Этап = ТекСтрокаРаботы.Этап;
		Движение.Работа = ТекСтрокаРаботы.Работа;
		Движение.Сотрудник = Сотрудник;
		Движение.ТрудозатратыЧД = ТекСтрокаРаботы.ТрудозатратыЧ;
		Движение.ТрудозатратыМД = ТекСтрокаРаботы.ТрудозатратыМ;
		Движение.Трудозатраты = ТекСтрокаРаботы.ТрудозатратыЧ + ТекСтрокаРаботы.ТрудозатратыМ/60;
		Движение.ТрудозатратыМинуты = Окр(ТекСтрокаРаботы.ТрудозатратыМ+ТекСтрокаРаботы.ТрудозатратыЧ*60,0);
		Движение.Содержание = ТекСтрокаРаботы.Содержание;
		Движение.Примечание = ТекСтрокаРаботы.Примечание;
		Движение.ПВР = ТекСтрокаРаботы.ПВРСтроки;


		ДвижениеРВ = Движения.bz_РаботыКВыставлению.Добавить();
		ДвижениеРВ.Период = Дата;
		ЗаполнитьЗначенияСвойств(ДвижениеРВ, Движение);
		
		ДвижениеРВ.КоличествоОтработано = Движение.Трудозатраты;
		
		Если ЗначениеЗаполнено(ТекСтрокаРаботы.Проект) Тогда
			МасПроектов.Добавить(ТекСтрокаРаботы.Проект);
		КонецЕсли;
	КонецЦикла;
	
	МасПроектов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МасПроектов);
	//ПроверитьСоздатьСостояниеЗакрытияПериодаПоПроектам(МасПроектов, Отказ);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	bz_СостоянияЗакрытияПериодов.Состояние КАК Состояние,
	|	bz_СостоянияЗакрытияПериодов.Период КАК Период,
	|	bz_СостоянияЗакрытияПериодов.ДатаДействияПо КАК ДатаДействияПо,
	|	bz_СостоянияЗакрытияПериодов.Проект КАК Проект
	|ИЗ
	|	РегистрСведений.bz_СостоянияЗакрытияПериодов КАК bz_СостоянияЗакрытияПериодов
	|ГДЕ
	|	bz_СостоянияЗакрытияПериодов.Проект В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Т.Проект КАК Проект
	|			ИЗ
	|				Документ.bz_ВыполнениеРабот.Работы КАК Т
	|			ГДЕ
	|				Т.Ссылка = &Ссылка)
	|	И bz_СостоянияЗакрытияПериодов.Период <= &Период
	|	И bz_СостоянияЗакрытияПериодов.ДатаДействияПо >= &Период";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", НачалоДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,"Дата" , , )));
	Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Состояние) и Выборка.Состояние <> Перечисления.bz_СостоянияПроектовВПериодах.Открыт Тогда
			ТекстСообщения = СтрШаблон(
			 	НСтр("ru='Период %1 по проекту %2 %3. Для отмены выработки необходимо его открыть.'"),
			 	ПредставлениеПериода(Выборка.Период, КонецДня(Выборка.ДатаДействияПо)),
				Строка(Выборка.Проект),
				Строка(Выборка.Состояние)
			 );
			 
			 Сообщение = Новый СообщениеПользователю;
			 Сообщение.Текст 		= ТекстСообщения;
			 Сообщение.Поле 			= "Дата";
			 Сообщение.ПутьКДанным 	= "Объект";
			 Сообщение.Сообщить();
			 Отказ = Истина;
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьПВРСтрок()	
	bz_ОбщиеАлгоритмыУУ.СоздатьПВРСтрок(ЭтотОбъект, Документы.bz_ВыполнениеРабот, "Работы", Дата,  "Содержание, Примечание", "ПВРСтроки");
КонецПроцедуры

#КонецОбласти

#КонецЕсли
>>>>>>> refs/remotes/origin/develop
