
&После("ОбработкаПроведения")
Процедура bz_ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.bz_ВыставленныеРаботы.Записывать = Истина;
	Для Каждого стр Из bz_ВыставляемыеРаботы Цикл
		Движение = Движения.bz_РаботыКВыставлению.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		ЗаполнитьЗначенияСвойств(Движение, стр);
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.КоличествоСогласовано = стр.Количество;
		Движение.СуммаСогласовано = стр.Сумма;
	КонецЦикла;
КонецПроцедуры
