
&После("ОбработкаПроведения")
Процедура bz_ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.bz_ВыставленныеРаботы.Записывать = Истина;
	Для Каждого стр Из bz_ВыставляемыеРаботы Цикл
		Движение = Движения.bz_ВыставленныеРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		ЗаполнитьЗначенияСвойств(Движение, стр);
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Документ = стр.ПервичныйДокумент;
		Движение.НомерСтр = стр.НомерСтрокиПервичногоДокумента;
		Движение.КоличествоКВыставлению = стр.Количество;
		Движение.СуммаКВыставлению = стр.Сумма;
	КонецЦикла;
КонецПроцедуры
