
Функция ПолучитьСтавку(знач Дата, знач Проект, знач Работа, знач КонтрагентРаботодатель) Экспорт 
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Проект КАК Проект,
	|	Т.Работа КАК Работа,
	|	Т.Контрагент КАК Контрагент,
	|	Т.Ставка КАК Ставка,
	|	Т.Действует КАК Действует,
	|	Т.Приоритет КАК Приоритет
	|ИЗ
	|	РегистрСведений.bz_ПочасовыеСтавкиРабот.СрезПоследних(
	|			&Дата,
	|			Контрагент В (&Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|				И Проект В (&Проект, ЗНАЧЕНИЕ(Справочник.bz_Проекты.ПустаяСсылка))
	|				И Работа В (&Работа, ЗНАЧЕНИЕ(Справочник.bz_Работы.ПустаяСсылка))) КАК Т
	|ГДЕ
	|	Т.Действует = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	Запрос.УстановитьПараметр("Контрагент", КонтрагентРаботодатель);
	Запрос.УстановитьПараметр("Работа", Работа);
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("Дата", Дата);
	Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ставка;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции
