
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр bz_ВыставленныеРаботы Приход
	Движения.bz_ВыставленныеРаботы.Записывать = Истина;
	Для Каждого ТекСтрокаТекущаяВыработка Из Выработка Цикл
		Если ТекСтрокаТекущаяВыработка.Количество - ТекСтрокаТекущаяВыработка.КоличествоВыставлено - ТекСтрокаТекущаяВыработка.КоличествоСписано < 0 Тогда 
			ТекстСообщения = НСтр("ru='Отработанное время должно быть не меньше, чем выставленное и списанное вместе'");
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст 		= ТекстСообщения;
			Сообщение.Поле 			= "Выработка[" + Формат(ТекСтрокаТекущаяВыработка.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].КоличествоОтработано";
			Сообщение.ПутьКДанным 	= "Объект";
			Сообщение.Сообщить();
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.bz_ВыставленныеРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Проект = Проект;
		Движение.Этап = ТекСтрокаТекущаяВыработка.Этап;
		Движение.Работа = ТекСтрокаТекущаяВыработка.Работа;
		Движение.Сотрудник = ТекСтрокаТекущаяВыработка.Сотрудник;
		Движение.Документ = Ссылка;
		Движение.НомерСтр = ТекСтрокаТекущаяВыработка.НомерСтроки;
		Движение.КоличествоОтработано = ТекСтрокаТекущаяВыработка.Количество;
		Движение.Сумма = ТекСтрокаТекущаяВыработка.Сумма;
		
		Если ТекСтрокаТекущаяВыработка.КоличествоВыставлено + ТекСтрокаТекущаяВыработка.КоличествоСписано > 0 Тогда
			Движение = Движения.bz_ВыставленныеРаботы.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Проект = Проект;
			Движение.Этап = ТекСтрокаТекущаяВыработка.Этап;
			Движение.Работа = ТекСтрокаТекущаяВыработка.Работа;
			Движение.Сотрудник = ТекСтрокаТекущаяВыработка.Сотрудник;
			Движение.Документ = Ссылка;
			Движение.НомерСтр = ТекСтрокаТекущаяВыработка.НомерСтроки;
			Движение.КоличествоОтработано = ТекСтрокаТекущаяВыработка.КоличествоВыставлено + ТекСтрокаТекущаяВыработка.КоличествоСписано;
			Если ТекСтрокаТекущаяВыработка.Количество <> 0 Тогда
				Движение.Сумма = ТекСтрокаТекущаяВыработка.Сумма/ТекСтрокаТекущаяВыработка.Количество*Движение.КоличествоОтработано;
			КонецЕсли;
		КонецЕсли;
		Если ТекСтрокаТекущаяВыработка.КоличествоВыставлено > 0 Тогда
			Движение = Движения.bz_ВыставленныеРаботы.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Проект = Проект;
			Движение.Этап = ТекСтрокаТекущаяВыработка.Этап;
			Движение.Работа = ТекСтрокаТекущаяВыработка.Работа;
			Движение.Сотрудник = ТекСтрокаТекущаяВыработка.Сотрудник;
			Движение.КоличествоКВыставлению = ТекСтрокаТекущаяВыработка.КоличествоВыставлено;
			Движение.Документ = Ссылка;
			Движение.НомерСтр = ТекСтрокаТекущаяВыработка.НомерСтроки;
			Если ТекСтрокаТекущаяВыработка.Количество <> 0 Тогда
				Движение.СуммаКВыставлению = ТекСтрокаТекущаяВыработка.Сумма/ТекСтрокаТекущаяВыработка.Количество*ТекСтрокаТекущаяВыработка.КоличествоВыставлено;
			КонецЕсли;
		КонецЕсли;
		Если ТекСтрокаТекущаяВыработка.КоличествоСписано > 0 Тогда
			Движение = Движения.bz_ВыставленныеРаботы.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Проект = Проект;
			Движение.Этап = ТекСтрокаТекущаяВыработка.Этап;
			Движение.Работа = ТекСтрокаТекущаяВыработка.Работа;
			Движение.Сотрудник = ТекСтрокаТекущаяВыработка.Сотрудник;
			Движение.КоличествоСписано = ТекСтрокаТекущаяВыработка.КоличествоСписано;
			Движение.Документ = Ссылка;
			Движение.НомерСтр = ТекСтрокаТекущаяВыработка.НомерСтроки;
			Если ТекСтрокаТекущаяВыработка.Количество <> 0 Тогда
				Движение.СуммаКВыставлению = ТекСтрокаТекущаяВыработка.Сумма/ТекСтрокаТекущаяВыработка.Количество*ТекСтрокаТекущаяВыработка.КоличествоСписано;
			КонецЕсли;
			
			ДвижениеРасход = Движения.bz_ВыставленныеРаботы.Добавить();
			ЗаполнитьЗначенияСвойств(ДвижениеРасход, Движение);
			ДвижениеРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
		КонецЕсли;
	КонецЦикла;
	
	Движения.bz_ВыставленныеРаботы.Записывать = Истина;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
