
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		Если Объект.Организация.Пустая() Тогда 
			ОсновнаяОрганизация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
			Справочники.Организации.ПроверитьНаличиеОрганизацииПриОднофирменномУчете(ОсновнаяОрганизация);
			Объект.Организация = ОсновнаяОрганизация;
		КонецЕсли;
		Если Объект.Сотрудник.Пустая() Тогда 
			ТекПользователь = Пользователи.ТекущийПользователь();
			Если ЗначениеЗаполнено(ТекПользователь) Тогда
				Объект.Сотрудник = ТекПользователь.ФизическоеЛицо;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаботыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока и не Копирование Тогда 
		ТекСтр = Элементы.Работы.ТекущиеДанные;
		Если ТекСтр = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если не Объект.Проект.Пустая() Тогда
			ТекСтр.Проект = Объект.Проект;
			Если не Объект.Этап.Пустая() Тогда
				ТекСтр.Этап = Объект.Этап;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
